app/forms/item_purchase.rb

  def save
    Purchase.create(user_id: user_id, item_id: item_id)
    Delivery.create(postal_code: postal_code, prefecture_id: prefecture_id, town: town, address: address, building: building, tel: tel, item_id: item_id)
---
INSERT INTO `purchases` (`user_id`, `item_id`, `created_at`, `updated_at`) VALUES (3, 4, '2020-08-04 12:09:36.321357', '2020-08-04 12:09:36.321357')
INSERT INTO `deliveries` (`postal_code`, `prefecture_id`, `town`, `address`, `building`, `tel`, `item_id`, `created_at`, `updated_at`) VALUES ('123-1234', 1, 'こうこう', 'こうこう', '', '12345678901', 4, '2020-08-04 12:19:26.948679', '2020-08-04 12:19:26.948679')