app/views/items/index.html.erb

SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` IN (3, 2, 1)
---

            <% if item.purchase.present? %>