app/views/items/show.html.erb

      <%= image_tag @item.image ,class:"item-box-img" %>
      <% if @item.purchase.present? %>
---
SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` = 2 LIMIT 1