app/controllers/items_controller.rb

  def index
    @items = Item.all.order(id: 'DESC').includes(:purchase)
---
SELECT `items`.* FROM `items` ORDER BY `items`.`id` DESC
SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` IN (3, 2, 1)

  def create
    binding.pry
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO `items` (`name`, `text`, `price`, `user_id`, `category_id`, `condition_id`, `postage_id`, `prefecture_id`, `shipment_delay_id`, `created_at`, `updated_at`) VALUES ('テスト出品', 'テスト出品', 3000, 3, 1, 1, 1, 1, 1, '2020-08-04 03:33:15.763243', '2020-08-04 03:33:15.763243')

  def update
    if @item.update(item_params)
---
UPDATE `items` SET `items`.`price` = 2000, `items`.`updated_at` = '2020-08-03 12:14:02.635022' WHERE `items`.`id` = 6

  def destroy
    if @item.user.id = current_user.id
      if @item.destroy
---
DELETE FROM `items` WHERE `items`.`id` = 3

  def set_item
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 5 LIMIT 1