app/controllers/purchases_controller.rb

  def create
    @purchase = ItemPurchase.new(purchase_params)
    if @purchase.valid?
      pay_item
      @purchase.save
---
INSERT INTO `purchases` (`user_id`, `item_id`, `created_at`, `updated_at`) VALUES (3, 4, '2020-08-04 12:09:36.321357', '2020-08-04 12:09:36.321357')

  def set_item
    @item = Item.find(params[:item_id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 5 LIMIT 1

  def item_present?
    redirect_to root_path if @item.purchase.present?
---
SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` = 5 LIMIT 1